In [0]:
#https://pandas.pydata.org/
#Biblioteca open source, 
#Licenciado sobre BSD
#Alto desempenho
#Facil de utilizar
#Inclui ferramentas de estruturas de dados e análise de dados

In [0]:
#Criar dataframe a partir de dicionário
import pandas as pd
d = {'col1': [1,2,1,3,1,2], 'col2': [1,2,3,4,5,6]}
df = pd.DataFrame(data=d)

In [5]:
df.count()

col1    6
col2    6
dtype: int64

In [6]:
df['col1'].value_counts()

1    3
5    1
3    1
2    1
Name: col1, dtype: int64

In [0]:
df['col1'][1]=5

In [10]:
#Copiar coluna
coluna1=df['col1']
coluna1[2]=99
#Qual o resultado em coluna1 e df?
df

   col1  col2
0     1     1
1     5     2
2    99     3
3     3     4
4     1     5
5     2     6

In [11]:
nova_coluna1 = coluna1.copy()
nova_coluna1[2]=9999
df

   col1  col2
0     1     1
1     5     2
2    99     3
3     3     4
4     1     5
5     2     6